#include <iostream>
using namespace std;

// Тэгш өнцөгтийн талуудыг өгөхөд талбайг буцаадаг хэрэглэгчийн функц бич.
int areaOfRectangle(int a, int b) {
	// Тэгш өнцөгтийн талбай олох томъёо s = a * b байдаг тул a, b тооны үржвэрийг буцааж байна
	return a * b;
}

int main() {
	// Гараас авах тэгш өнцөгтийн талуудыг хадгалах хувьсагч зарлах
	int a, b;

	// Гараас тэгш өнцөгтийн талуудыг авах
	cin >> a >> b;

	// Тэгш өнцөгтийн талбай буцаадаг хэрэглэгчийн функцээ ашиглан талбайг олоод хэвлэх
	cout << "Area: " << areaOfRectangle(a, b) << endl;
	
	return 0;
}
