#include <iostream>
using namespace std;

// Гараас өгөгдсөн N ширхэг тооны нийлбэр, үржвэрийг ол
int main() {
	// n тоо болон гараас оруулах тоо, нийлбэр8 үржвэр хадгалах хувьсагч зарлах
	int n, x, sum = 0, mul = 1;
	// Гараас n тоог авч байна
	cin >> n;
	
	// n ширхэг тоо гараас авах учир давталт ашиглав
	for(int i = 0; i < n; i++) {
		// Гараас тоо авах
		cin >> x;
		// Авсан тоо өмнөх тоонуудтай нэмж, үржиж байна
		sum += x;
		mul *= x;
	}
	
	// Үр дүнг хэвлэх
	cout << "Sum: " << sum << endl;
	cout << "Multiply: " << mul << endl;
	
	return 0;
}
