#include <iostream>
using namespace std;

// Өгөгдсөн хүснэгтийн тэгш элементүүдийн тоог ол.
int main() {
	// Өгөгдсөн хүснэгт гэсэн учраас хүснэгтийг гараас зарлаж өгөв
	int a[] = {0, 1, 2, 3, 4, 5, 6, 7, 8, 9};
	// Хүснэгтийн урт буюу элементийн тоог тооцоолж байна
	int n = sizeof(a) / sizeof(a[0]);
	// Тэгш элементүүдийн тоог хадгалах хувьсагч зарлав
	int count = 0;
	
	// Хүснэгтийн тоо бүрээр давтах давталт
	for(int i = 0; i < n; i++)
		// Тухайн тоо тэгш эсэхийг шалгахдаа 2-т үлдэгдэлтэй хуваан хэрэв үлдэгдэл нь 0 байвал тэгш тоо гэж үзсэн
		if(a[i] % 2 == 0)
			// Тэгш тоо учир тэгш элементүүдийн тоог нэгээр нэмэгдүүлэв
			count++;
			
	// Үр дүнг хэвлэж байна
	cout << "Number of even: " << count << endl;
	
	
	return 0;
}
