#include <iostream>
using namespace std;

// Өгөгдсөн хүснэгтийн арифметик дунджийг олдог хэрэглэгчийн функц бич.
double arrAvg(int a[], int n) {
	// Тоонуудын нийлбэр, дундаж хадгалах хувьсагч
	int sum = 0;
	double avg;

	// Давталт ашиглан хүснэгтэнд байгаа тоонуудын нийлбэр олох
	for(int i = 0; i < n; i++)
		sum += a[i];

	// Нийлбэрийг нийт хэдэн тоо байгаад хуваан дундажыг олоод буцаах.
	avg = sum / n;
	return avg;
}

int main() {
	// Өгөгдсөн хүснэгт гэсэн учраас хүснэгтийг гараас зарлаж өгөв
	int a[] = {0, 1, 2, 3, 4, 5, 6, 7, 8, 9};
	// Хүснэгтийн урт буюу элементийн тоог тооцоолж байна
	int n = sizeof(a) / sizeof(a[0]);

	// Бичсэн хэрэглэгийн функцээ ашиглан үр дүнг хэвлэв	
	cout << "a[] = {0, 1, 2, 3, 4, 5, 6, 7, 8, 9}" << endl;	
	cout << "AVG: " << arrAvg(a, n) << endl;
	
	
	return 0;
}
